Revit 2027 API
FlexDuct.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>) |  Creates a new flexible duct into the document, using a point array and flexible duct type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>) |  Creates a new flexible duct into the document, using a point array and flexible duct type.
Top
See Also
Reference
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace